[
  {
    "id": "6230907",
    "title": "Software Engineer Intern",
    "jobType": "Internship",
    "companyName": "Stripe",
    "skills": ["Java", "Ruby", "JavaScript", "Scala", "Go", "Systems Design", "Testing"],
    "locations": ["Bengaluru, India"],
    "description": "Work on meaningful real-world projects at Stripe that directly impact global commerce. Gain hands-on experience with multiple technologies, systems design, testing, and contribute to products that grow the GDP of the internet.",
    "applyLink": "https://stripe.com/jobs/listing/software-engineer-intern/6230907",
    "category": "Software Development",
    "responsibilities": "Write production-level software, participate in code reviews and design discussions, collaborate with engineers and cross-functional teams, learn quickly by asking questions, and ship impactful projects.",
    "qualifications": "Currently pursuing a Bachelor's, Master's, or PhD in Computer Science, Math, or related field; strong CS fundamentals; programming experience in Java, Ruby, JavaScript, Scala, or Go; ability to work in teams and learn new systems.",
    "salary": "6-8 LPA"
  },
  {
    "id": "313944",
    "title": "Software Engineer Intern",
    "jobType": "Internship",
    "companyName": "Cargill",
    "skills": ["Java", "Go", "Cloud", "Big Data", "SQL", "Agile"],
    "locations": ["Bengaluru, India"],
    "description": "Gain real-world experience as a Software Engineer Intern with Cargill’s Digital Technology & Data team. Work on cloud platforms, big data, and application development while collaborating with global teams.",
    "applyLink": "https://careers.cargill.com/en/job/bengaluru/software-engineer-intern/23251/85548314848?utm_source=indeed",
    "category": "Software Development",
    "responsibilities": "Contribute to software engineering projects, apply programming and analytical skills, work on cloud and big data platforms, participate in agile development, and gain exposure to real business situations.",
    "qualifications": "Currently pursuing a Bachelor's degree in Computer Science, Engineering, AI/ML, Cybersecurity, or related IT discipline; graduating in June 2026; strong programming and problem-solving skills; ability to work in a global team environment.",
    "salary": "5-13 LPA"
  },
  {
    "id": "9",
    "title": "Software Development Engineer - 2025 Freshers",
    "jobType": "Full-time",
    "companyName": "Byteridge Software Private Limited",
    "skills": ["Angular", "React.js", "Vue.js", "Android", "iOS", "Flutter", "React Native", ".NET", "Node.js", "Java", "Spring Boot", "MongoDB", "MySQL", "MariaDB", "Express.js", "Koa.js", "Swagger", "AI/ML", "Git", "Jenkins"],
    "locations": ["Hyderabad, Telangana, India", "Hybrid"],
    "description": "Byteridge is hiring 2025 B.Tech graduates as Software Development Engineers. Freshers will work on real-world projects in frontend, backend, mobile, and AI/ML technologies, gaining mentorship and hands-on experience across modern web, mobile, and cloud stacks.",
    "applyLink": "https://byteridge.turbohire.co/job/publicjobs/BkGNuGYbjuUcHKX4RrS0%2F2l92jfB1R0XWS9rsGG3Ui2ZEqmDbB_KNWy2uF7PWavvgOSd%2FYNNL3lM9xX_hHTLqS6S9%2F60JXxstLLzAKMquaYTw51P7XuAnnLPB6_ETFY6hDcNLqhsR86qEq877wZ_cxSrmsF8KNAxXw%2F0GVdrQtPvnD_bgGM%2F5FkKgEfoVvITO4wFWgpoT_LkRJlYQnWuK2qzBt6DQ0wJ3O2xSUq95piMeGaW0mpN85kRkijdGzwp",
    "category": "Software Development",
    "responsibilities": "Collaborate with teams to design, develop, and maintain scalable applications. Work on frontend, backend, mobile, or AI/ML projects. Participate in code reviews, debugging, and deployment processes. Engage in real-world projects under mentorship and continuously upskill in emerging technologies.",
    "qualifications": "B.Tech 2025 graduates in Computer Science, IT, ECE, EEE, or related fields with computer science coursework. Strong programming knowledge in frontend/backend/mobile/AI/ML stacks such as Angular, React.js, .NET, Node.js, Java, Flutter, or related technologies. Internship/project experience preferred. Strong problem-solving, communication, and teamwork skills.",
    "salary": "3-5 LPA"
  },
  {
    "id": "21596",
    "title": "Associate Software Development Engineer",
    "jobType": "Full-time",
    "companyName": "Swiggy",
    "skills": ["Java", "Go", "Elasticache", "Elasticsearch", "Kafka", "SQS", "DynamoDB", "AWS", "Azure", "GCP", "Git"],
    "locations": ["Bangalore, India", "Hybrid"],
    "description": "Swiggy is hiring Associate Software Development Engineers (aSDEs) to design, develop, and maintain scalable backend systems using modern technologies. This role offers fresh graduates the opportunity to gain hands-on experience in backend development while working alongside experienced engineers.",
    "applyLink": "https://careers.swiggy.com/#/careers?src%3Dcareers%26p%3DeyJwYWdlVHlwZSI6ImpkIiwiY3ZTb3VyY2UiOiJjYXJlZXJzIiwicmVxSWQiOjIxNTk2LCJyZXF1ZXN0ZXIiOnsiaWQiOiIiLCJjb2RlIjoiIiwibmFtZSI6IiJ9LCJwYWdlIjoiY2FyZWVycyIsImJ1ZmlsdGVyIjotMSwiY3VzdG9tRmllbGRzIjp7fX0=",
    "category": "Software Development",
    "responsibilities": "Collaborate with teams to design and maintain backend systems, write high-quality code in Java and Go, use tools like Elasticache, Elasticsearch, Kafka, SQS, and DynamoDB to build backend solutions, participate in code reviews, contribute to architecture discussions, and troubleshoot issues to optimize performance.",
    "qualifications": "B.Tech graduates (2024/2025) in Computer Science or related field. Strong programming skills in Java/Go, familiarity with backend concepts, databases, and cloud platforms (AWS, Azure, GCP). Good communication and problem-solving skills, eagerness to learn, and ability to work in a collaborative environment.",
    "salary": "10-15 LPA"
  },
  {
    "id": "PUNE6780",
    "title": "Intern",
    "jobType": "Internship",
    "companyName": "Data Axle",
    "skills": ["HR", "Talent Acquisition", "Finance", "Administration", "Project Management", "MS Office", "Google Workspace", "Trello", "Jira", "Asana"],
    "locations": ["Pune, India"],
    "description": "Data Axle is hiring interns across HR, Talent Acquisition, Finance, Administration, and Project Management. This 6-month internship provides exposure to real-world business operations, mentorship from professionals, and opportunities for future employment consideration.",
    "applyLink": "https://myjobs.adp.com/dataaxleindia/cx/job-details?__tx_annotation=false&rb=INDEED&reqId=5001144985700",
    "category": "Internship",
    "responsibilities": "Assist with HR onboarding, engagement, and database management. Support talent acquisition through job postings, resume screening, and interview coordination. Contribute to finance operations, reconciliations, and reporting. Assist with office administration, vendor coordination, and logistics. Support project management by tracking progress, documenting meetings, and managing dashboards.",
    "qualifications": "Currently pursuing a Bachelor's or Master's degree in Business, Management, HR, Finance, or related fields. Strong communication skills, detail-oriented, eager to learn, and proficient in MS Office/Google Workspace. Available for a minimum of 6 months.",
    "salary": "Stipend"
  },
  {
    "id": "4758",
    "title": "Associate Technical Support I",
    "jobType": "Full-time",
    "companyName": "Anthology",
    "skills": ["Windows", "Linux", "SQL", "PowerShell", "Azure", "AWS", "Networking (TCP/IP, DNS, DHCP)", "Troubleshooting", "Ticketing Systems (ADO, Salesforce)"],
    "locations": ["Bangalore, India", "Hybrid"],
    "description": "Anthology is seeking a motivated Associate Technical Support I to provide first-level application and infrastructure support, document root cause analyses, and ensure smooth communication with customers. This role offers an opportunity to grow technical skills while supporting critical systems in a dynamic environment.",
    "applyLink": "https://careers.anthology.com/jobs/16396105-system-engineer",
    "category": "Software Jobs",
    "responsibilities": "Provide first-level support for applications and infrastructure, troubleshoot operating systems, networks, and applications, document root cause analyses and knowledge base articles, communicate with clients via multiple channels, participate in on-call support, proactively monitor systems, and collaborate with cross-functional teams to ensure smooth issue resolution.",
    "qualifications": "0-2 years of experience in IT support or system administration. Familiarity with ticketing systems (ADO, Salesforce), Windows/Linux, SQL basics, PowerShell scripting, networking fundamentals, and cloud platforms (Azure, AWS). Strong communication, problem-solving, and collaboration skills required. Preferred: knowledge of VMware, Docker, CI/CD pipelines, and ITIL processes.",
    "salary": "6-9 LPA"
  },
  {
    "id": "2995991",
    "title": "Software Development Engineer - I",
    "jobType": "Full-time",
    "companyName": "Amazon",
    "skills": ["Java", "C++", "Python", "Data Structures", "Algorithms", "Distributed Systems"],
    "locations": ["Bengaluru, Karnataka, India"],
    "description": "Amazon is seeking passionate Software Development Engineers to design, build, and scale innovative technologies across distributed computing environments. SDEs will solve complex problems, build scalable systems, and deliver impactful solutions to millions of customers worldwide.",
    "applyLink": "https://amazon.jobs/en/jobs/2995991/software-development-engineer-i",
    "category": "Software Jobs",
    "responsibilities": "Collaborate with cross-disciplinary teams to design and deliver innovative products, build scalable distributed systems, create predictive solutions, design and code solutions starting from broad problems, and work in an agile environment to deliver high-quality software.",
    "qualifications": "Currently enrolled in a Bachelor's or Master's degree in Computer Science, Computer Engineering, or related field. Strong knowledge of OOP, algorithms, data structures, problem solving, and programming in Java, C/C++ or Python. Preferred qualifications include prior internships, experience with multi-tiered systems, optimization mathematics, and ability to articulate technical challenges.",
    "salary": "40-45 LPA"
  },
  {
    "id": "2304065",
    "title": "Software Engineer",
    "jobType": "Full-time",
    "companyName": "UnitedHealth Group (Optum)",
    "skills": ["Python", "JavaScript", "Node.js", "GitHub", "CI/CD", "Kubernetes", "AWS", "Azure", "Google Cloud", "Infrastructure as Code", "GitHub Copilot", "AI-assisted Development"],
    "locations": ["Bangalore, Karnataka, India"],
    "description": "Developer position for GitHub Cloud Team at Optum. This role involves building and managing GitHub Runners in Public Cloud, driving automation with IaC, applying AI-assisted development, and collaborating with cross-functional teams to improve efficiency and platform capabilities.",
    "applyLink": "https://careers.unitedhealthgroup.com/job/22317319/software-engineer-bangalore-in/?p_sid=gfCP3Mb&p_uid=6qbSACOKWb&src=JB-22511&ss=paid&utm_campaign=india+tech&utm_content=pj_board&utm_medium=jobad&utm_source=indeed&gad_source=7&dclid=COzozsnojo8DFd6LZgId67k7cA",
    "category": "Software Jobs",
    "salary": "10-15 LPA",
    "responsibilities": "Build and manage GitHub Runners in Public Cloud, create automation tools and pipelines, apply AI-assisted development techniques, prototype and validate ideas with LLM-based tools, enhance platform capabilities with RAG, MCP, and vector databases, document processes and best practices, collaborate with cross-functional teams to drive GitHub Actions adoption and training.",
    "qualifications": "Undergraduate degree or equivalent experience, experience with cloud platforms (AWS, Azure, GCP) and Kubernetes, programming in Python, JavaScript, Node.js, understanding of Git/GitHub and CI/CD pipelines, knowledge of Infrastructure as Code, experience with GitHub Copilot or similar AI tools, ability to create effective prompts for generative models."
  },
  {
    "id": "1",
    "title": "Software Development Engineer",
    "jobType": "Full-time",
    "companyName": "Nokia Corporation",
    "skills": ["C/C++", "Linux", "Embedded Systems", "Device Drivers", "ASIC SDK", "Protocol Software Design"],
    "locations": ["Bangalore, Karnataka, India"],
    "description": "Join the Optical Networks division at Nokia, where innovation meets scale in the AI-driven data center era. You will work on developing a new SDK for next-generation ASICs, executing test plans, and supporting software integration.",
    "applyLink": "https://fa-evmr-saasfaprod1.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1/job/23251?utm_medium=jobshare&src=SNS-102",
    "category": "Software Jobs",
    "salary": "5-6 LPA",
    "responsibilities": "Work closely with architecture and ASIC teams to develop a new SDK for next-generation ASICs, develop SDK APIs and algorithms, define and execute SDK test plans, support software integrations, prepare design documentation, and collaborate with ASIC and Optical architecture teams.",
    "qualifications": "Bachelor’s degree in Computer Engineering, Computer Science, Electrical Engineering, or a related field, 0–2 years of experience in software development in the communications industry, coding and debugging experience in C/C++ (must), experience with Linux or similar RTOS (good to have), embedded, device driver, and protocol software design experience (good to have), hands-on experience with ASIC SDK development (good to have), experience with GIGE, OTN, or DSP (optional)."
  },
  {
    "id": "JR248715",
    "title": "Associate Software Engineer (Internship Program to Full-time Employee)",
    "jobType": "Full-time",
    "companyName": "Kaplan, Inc.",
    "skills": ["Java", "Python", "React", "Angular", "NodeJS", ".Net", "Salesforce Apex", "Visualforce", "Lightning", "JavaScript", "HTML", "CSS", "Shell"],
    "locations": ["Bangalore, Karnataka, India"],
    "description": "As an Associate Software Engineer, you will manage all phases of the software development lifecycle, including programming, testing, and documentation. You will ensure high-quality software delivery, participate in agile methodologies, and actively engage in scrum ceremonies.",
    "applyLink": "https://ghc.wd1.myworkdayjobs.com/en-US/Kaplan_Careers/job/Bangalore-KA-India/Associate-Software-Engineer--Internship-Program-to-Full-time-Employee-_JR248715-1?source=IDD",  
    "category": "Software Jobs",
    "salary": "5-6 LPA",
    "responsibilities": "Understand all phases of the SDLC, program, test, and document applications, execute and troubleshoot existing code, deliver high-quality software products, write test cases, improve documentation, and participate in agile/scrum ceremonies.",
    "qualifications": "BS/MS in Computer Science, Engineering, or a related field. Knowledge of data structures, object-oriented programming, n-tier architectures, unit testing, debugging, Agile methodology, and team development tools. Preferred: familiarity with frontend and backend technologies such as HTML, CSS, Angular, React, NodeJS, .Net, Java, Salesforce Apex, Visualforce, Lightning, JavaScript, Shell, and Python."
  }
]
